Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMR35_DFP/2.1.62/edc/ATSAMR35J17B.PIC
      <edc:AdjustPoint edc:_addr="0x40001020" edc:offset="0x3E0"/>
      <edc:SFRDef edc:_addr="0x40001400" edc:access="---------------------nnn--nnnnnn" edc:cname="INTENCLR" edc:impl="0x73F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:desc="BOD12 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:desc="BOD12 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:desc="BOD12 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:desc="Voltage Regulator Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:desc="Automatic Power Switch Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:desc="VDDCORE Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001404" edc:access="---------------------nnn--nnnnnn" edc:cname="INTENSET" edc:impl="0x73F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:desc="BOD12 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:desc="BOD12 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:desc="BOD12 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:desc="Voltage Regulator Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:desc="Automatic Power Switch Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:desc="VDDCORE Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001408" edc:access="---------------------nnn--nnnnnn" edc:cname="INTFLAG" edc:impl="0x73F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:desc="BOD12 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:desc="BOD12 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:desc="BOD12 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:desc="Voltage Regulator Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:desc="Automatic Power Switch Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:desc="VDDCORE Ready" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000140C" edc:access="--------------------rrrr--rrrrrr" edc:cname="STATUS" edc:impl="0xF3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:SFRFieldDef edc:cname="BOD33RDY" edc:desc="BOD33 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD33DET" edc:desc="BOD33 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B33SRDY" edc:desc="BOD33 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12RDY" edc:desc="BOD12 Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOD12DET" edc:desc="BOD12 Detection" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="B12SRDY" edc:desc="BOD12 Synchronization Ready" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="VREGRDY" edc:desc="Voltage Regulator Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="APWSRDY" edc:desc="Automatic Power Switch Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VCORERDY" edc:desc="VDDCORE Ready" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BBPS" edc:desc="Battery Backup Power Switch" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40001410" edc:access="--nnnnnn--nnnnnnnnnn-n-nnnnnnnn-" edc:cname="BOD33" edc:impl="0x3F3FF5FE" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SUPC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SUPC">
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HYST" edc:desc="Hysteresis Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTION" edc:desc="Action when Threshold Crossed" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No action" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="The BOD33 generates a reset" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="INT" edc:desc="The BOD33 generates an interrupt" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="BKUP" edc:desc="The BOD33 puts the device in backup sleep mode if VMON=0" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="STDBYCFG" edc:desc="Configuration in Standby mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RUNBKUP" edc:desc="Configuration in Backup mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ACTCFG" edc:desc="Configuration in Active mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="VMON" edc:desc="Voltage Monitored in active and standby mode" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="PSEL" edc:desc="Prescaler Select" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="Divide clock by 2" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="Divide clock by 4" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="Divide clock by 8" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="Divide clock by 16" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="DIV32" edc:desc="Divide clock by 32" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="Divide clock by 64" edc:when="(field &amp; 0xF) == 0x5"/>
              <edc:SFRFieldSemantic edc:cname="DIV128" edc:desc="Divide clock by 128" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="Divide clock by 256" edc:when="(field &amp; 0xF) == 0x7"/>
              <edc:SFRFieldSemantic edc:cname="DIV512" edc:desc="Divide clock by 512" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="Divide clock by 1024" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="DIV2048" edc:desc="Divide clock by 2048" edc:when="(field &amp; 0xF) == 0xA"/>
              <edc:SFRFieldSemantic edc:cname="DIV4096" edc:desc="Divide clock by 4096" edc:when="(field &amp; 0xF) == 0xB"/>
              <edc:SFRFieldSemantic edc:cname="DIV8192" edc:desc="Divide clock by 8192" edc:when="(field &amp; 0xF) == 0xC"/>
              <edc:SFRFieldSemantic edc:cname="DIV16384" edc:desc="Divide clock by 16384" edc:when="(field &amp; 0xF) == 0xD"/>
              <edc:SFRFieldSemantic edc:cname="DIV32768" edc:desc="Divide clock by 32768" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="DIV65536" edc:desc="Divide clock by 65536" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LEVEL" edc:desc="Threshold Level for VDD" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BKUPLEVEL" edc:desc="Threshold Level in backup sleep mode or for VBAT" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
